haskell/paper/haroldcarr/2014-02-11-monads-at-lambda-lounge-slc/20-motivation.org
#+TITLE:     motivation for monads
#+AUTHOR:    Harold Carr

# Created       : 2014 Jan 28 (Tue) 19:09:36 by Harold Carr.
# Last Modified : 2014 Apr 17 (Thu) 15:31:11 by Harold Carr.
#+OPTIONS:     num:nil toc:nil
#+OPTIONS:     skip:nil author:nil email:nil creator:nil timestamp:nil
#+INFOJS_OPT:  view:nil toc:t ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js

# ------------------------------------------------------------------------------
* Motivation for Monads

# --------------------------------------------------
** example: non-monadic evaluator

#+begin_src haskell
type Name   =  String                -- variable names

data Exp    =  Lit  Integer          -- expressions
            |  Var  Name
            |  Plus Exp  Exp
            |  Abs  Name Exp
            |  App  Exp  Exp
            deriving (Eq, Show)

data Value  =  IntVal Integer        -- values
            |  FunVal Env Name Exp
            deriving (Eq, Show)

type Env    =  Map.Map Name Value    -- mapping from names to values
#+end_src

#+begin_src haskell
eval0                 :: Env -> Exp -> Value
eval0 env (Lit i)      = IntVal i
eval0 env (Var n)      = fromJust (Map.lookup n env)
eval0 env (Plus e1 e2) = let  IntVal i1  = eval0 env e1
                              IntVal i2  = eval0 env e2
                         in IntVal (i1 + i2)
eval0 env (Abs  n  e)  = FunVal env n e
eval0 env (App  e1 e2) = let  val1  = eval0 env e1
                              val2  = eval0 env e2
                         in case val1 of
                              FunVal env' n body ->
                                  eval0 (Map.insert n val2 env') body
#+end_src

#+begin_src haskell
-- 12 + (\x -> x) (4 + 2)
exampleExp
=> Plus (Lit 12) (App (Abs "x" (Var "x")) (Plus (Lit 4) (Lit 2)))

eval0 Map.empty exampleExp
=> IntVal 18

eval0 Map.empty (Plus (Lit 2) (Abs "x" (Lit 1)))
=> IntVal *** Exception: m.hs:59:31-55: Irrefutable pattern failed for pattern Main.IntVal i2

eval0 Map.empty (Var "x")
=> *** Exception: Maybe.fromJust: Nothing
#+end_src

# --------------------------------------------------
