haskell/paper/haroldcarr/2014-02-11-monads-at-lambda-lounge-slc/20-motivation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>motivation for monads</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
</head>
<body>
<div id="content">
<h1 class="title">motivation for monads</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Motivation for Monads</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">example: non-monadic evaluator</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #A52A2A; font-weight: bold;">type</span> <span style="color: #2F8B58; font-weight: bold;">Name</span>   <span style="color: #0084C8; font-weight: bold;">=</span>  <span style="color: #2F8B58; font-weight: bold;">String</span>                <span style="color: #5F7F5F;">-- </span><span style="color: #204A87;">variable names</span>

<span style="color: #A52A2A; font-weight: bold;">data</span> <span style="color: #2F8B58; font-weight: bold;">Exp</span>    <span style="color: #0084C8; font-weight: bold;">=</span>  <span style="color: #2F8B58; font-weight: bold;">Lit</span>  <span style="color: #2F8B58; font-weight: bold;">Integer</span>          <span style="color: #5F7F5F;">-- </span><span style="color: #204A87;">expressions</span>
            <span style="color: #0084C8; font-weight: bold;">|</span>  <span style="color: #2F8B58; font-weight: bold;">Var</span>  <span style="color: #2F8B58; font-weight: bold;">Name</span>
            <span style="color: #0084C8; font-weight: bold;">|</span>  <span style="color: #2F8B58; font-weight: bold;">Plus</span> <span style="color: #2F8B58; font-weight: bold;">Exp</span>  <span style="color: #2F8B58; font-weight: bold;">Exp</span>
            <span style="color: #0084C8; font-weight: bold;">|</span>  <span style="color: #2F8B58; font-weight: bold;">Abs</span>  <span style="color: #2F8B58; font-weight: bold;">Name</span> <span style="color: #2F8B58; font-weight: bold;">Exp</span>
            <span style="color: #0084C8; font-weight: bold;">|</span>  <span style="color: #2F8B58; font-weight: bold;">App</span>  <span style="color: #2F8B58; font-weight: bold;">Exp</span>  <span style="color: #2F8B58; font-weight: bold;">Exp</span>
            <span style="color: #A52A2A; font-weight: bold;">deriving</span> (<span style="color: #2F8B58; font-weight: bold;">Eq</span>, <span style="color: #2F8B58; font-weight: bold;">Show</span>)

<span style="color: #A52A2A; font-weight: bold;">data</span> <span style="color: #2F8B58; font-weight: bold;">Value</span>  <span style="color: #0084C8; font-weight: bold;">=</span>  <span style="color: #2F8B58; font-weight: bold;">IntVal</span> <span style="color: #2F8B58; font-weight: bold;">Integer</span>        <span style="color: #5F7F5F;">-- </span><span style="color: #204A87;">values</span>
            <span style="color: #0084C8; font-weight: bold;">|</span>  <span style="color: #2F8B58; font-weight: bold;">FunVal</span> <span style="color: #2F8B58; font-weight: bold;">Env</span> <span style="color: #2F8B58; font-weight: bold;">Name</span> <span style="color: #2F8B58; font-weight: bold;">Exp</span>
            <span style="color: #A52A2A; font-weight: bold;">deriving</span> (<span style="color: #2F8B58; font-weight: bold;">Eq</span>, <span style="color: #2F8B58; font-weight: bold;">Show</span>)

<span style="color: #A52A2A; font-weight: bold;">type</span> <span style="color: #2F8B58; font-weight: bold;">Env</span>    <span style="color: #0084C8; font-weight: bold;">=</span>  <span style="color: #2F8B58; font-weight: bold;">Map.Map</span> <span style="color: #2F8B58; font-weight: bold;">Name</span> <span style="color: #2F8B58; font-weight: bold;">Value</span>    <span style="color: #5F7F5F;">-- </span><span style="color: #204A87;">mapping from names to values</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #00578E; font-weight: bold;">eval0</span>                 <span style="color: #0084C8; font-weight: bold;">::</span> <span style="color: #2F8B58; font-weight: bold;">Env</span> <span style="color: #0084C8; font-weight: bold;">-&gt;</span> <span style="color: #2F8B58; font-weight: bold;">Exp</span> <span style="color: #0084C8; font-weight: bold;">-&gt;</span> <span style="color: #2F8B58; font-weight: bold;">Value</span>
<span style="color: #00578E; font-weight: bold;">eval0</span> env (<span style="color: #2F8B58; font-weight: bold;">Lit</span> i)      <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #2F8B58; font-weight: bold;">IntVal</span> i
<span style="color: #00578E; font-weight: bold;">eval0</span> env (<span style="color: #2F8B58; font-weight: bold;">Var</span> n)      <span style="color: #0084C8; font-weight: bold;">=</span> fromJust (<span style="color: #2F8B58; font-weight: bold;">Map</span><span style="color: #0084C8; font-weight: bold;">.</span>lookup n env)
<span style="color: #00578E; font-weight: bold;">eval0</span> env (<span style="color: #2F8B58; font-weight: bold;">Plus</span> e1 e2) <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #A52A2A; font-weight: bold;">let</span>  <span style="color: #2F8B58; font-weight: bold;">IntVal</span> i1  <span style="color: #0084C8; font-weight: bold;">=</span> eval0 env e1
                              <span style="color: #2F8B58; font-weight: bold;">IntVal</span> i2  <span style="color: #0084C8; font-weight: bold;">=</span> eval0 env e2
                         <span style="color: #A52A2A; font-weight: bold;">in</span> <span style="color: #2F8B58; font-weight: bold;">IntVal</span> (i1 <span style="color: #0084C8; font-weight: bold;">+</span> i2)
<span style="color: #00578E; font-weight: bold;">eval0</span> env (<span style="color: #2F8B58; font-weight: bold;">Abs</span>  n  e)  <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #2F8B58; font-weight: bold;">FunVal</span> env n e
<span style="color: #00578E; font-weight: bold;">eval0</span> env (<span style="color: #2F8B58; font-weight: bold;">App</span>  e1 e2) <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #A52A2A; font-weight: bold;">let</span>  val1  <span style="color: #0084C8; font-weight: bold;">=</span> eval0 env e1
                              val2  <span style="color: #0084C8; font-weight: bold;">=</span> eval0 env e2
                         <span style="color: #A52A2A; font-weight: bold;">in</span> <span style="color: #A52A2A; font-weight: bold;">case</span> val1 <span style="color: #A52A2A; font-weight: bold;">of</span>
                              <span style="color: #2F8B58; font-weight: bold;">FunVal</span> env' n body <span style="color: #0084C8; font-weight: bold;">-&gt;</span>
                                  eval0 (<span style="color: #2F8B58; font-weight: bold;">Map</span><span style="color: #0084C8; font-weight: bold;">.</span>insert n val2 env') body
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #5F7F5F;">-- </span><span style="color: #204A87;">12 + (\x -&gt; x) (4 + 2)</span>
exampleExp
<span style="color: #0084C8; font-weight: bold;">=&gt;</span> <span style="color: #2F8B58; font-weight: bold;">Plus</span> (<span style="color: #2F8B58; font-weight: bold;">Lit</span> 12) (<span style="color: #2F8B58; font-weight: bold;">App</span> (<span style="color: #2F8B58; font-weight: bold;">Abs</span> <span style="color: #4E9A06;">"x"</span> (<span style="color: #2F8B58; font-weight: bold;">Var</span> <span style="color: #4E9A06;">"x"</span>)) (<span style="color: #2F8B58; font-weight: bold;">Plus</span> (<span style="color: #2F8B58; font-weight: bold;">Lit</span> 4) (<span style="color: #2F8B58; font-weight: bold;">Lit</span> 2)))

<span style="color: #00578E; font-weight: bold;">eval0</span> <span style="color: #2F8B58; font-weight: bold;">Map</span><span style="color: #0084C8; font-weight: bold;">.</span>empty exampleExp
<span style="color: #0084C8; font-weight: bold;">=&gt;</span> <span style="color: #2F8B58; font-weight: bold;">IntVal</span> 18

<span style="color: #00578E; font-weight: bold;">eval0</span> <span style="color: #2F8B58; font-weight: bold;">Map</span><span style="color: #0084C8; font-weight: bold;">.</span>empty (<span style="color: #2F8B58; font-weight: bold;">Plus</span> (<span style="color: #2F8B58; font-weight: bold;">Lit</span> 2) (<span style="color: #2F8B58; font-weight: bold;">Abs</span> <span style="color: #4E9A06;">"x"</span> (<span style="color: #2F8B58; font-weight: bold;">Lit</span> 1)))
<span style="color: #0084C8; font-weight: bold;">=&gt;</span> <span style="color: #2F8B58; font-weight: bold;">IntVal</span> <span style="color: #0084C8; font-weight: bold;">***</span> <span style="color: #2F8B58; font-weight: bold;">Exception:</span> m<span style="color: #0084C8; font-weight: bold;">.</span>hs<span style="color: #2F8B58; font-weight: bold;">:</span>59<span style="color: #2F8B58; font-weight: bold;">:</span>31<span style="color: #0084C8; font-weight: bold;">-</span>55<span style="color: #2F8B58; font-weight: bold;">:</span> <span style="color: #2F8B58; font-weight: bold;">Irrefutable</span> pattern failed for pattern <span style="color: #2F8B58; font-weight: bold;">Main.IntVal</span> i2

<span style="color: #00578E; font-weight: bold;">eval0</span> <span style="color: #2F8B58; font-weight: bold;">Map</span><span style="color: #0084C8; font-weight: bold;">.</span>empty (<span style="color: #2F8B58; font-weight: bold;">Var</span> <span style="color: #4E9A06;">"x"</span>)
<span style="color: #0084C8; font-weight: bold;">=&gt;</span> <span style="color: #0084C8; font-weight: bold;">***</span> <span style="color: #2F8B58; font-weight: bold;">Exception:</span> <span style="color: #2F8B58; font-weight: bold;">Maybe</span><span style="color: #0084C8; font-weight: bold;">.</span>fromJust<span style="color: #2F8B58; font-weight: bold;">:</span> <span style="color: #2F8B58; font-weight: bold;">Nothing</span>
</pre>
</div>
</div>
</div>
