haskell/paper/haroldcarr/2014-02-11-monads-at-lambda-lounge-slc/20-motivation.org
** equivalent monadic evaluator

#+begin_src haskell
type Eval1 alpha  =   Identity alpha

runEval1          ::  Eval1 alpha -> alpha
runEval1 ev       =   runIdentity ev

eval1                 :: Env -> Exp -> Eval1 Value
eval1 env (Lit i)      = return $ IntVal i
eval1 env (Var n)      = return $ fromJust (Map.lookup n env)
eval1 env (Plus e1 e2) = do  IntVal i1  <- eval1 env e1
                             IntVal i2  <- eval1 env e2
                             return $ IntVal (i1 + i2)
eval1 env (Abs n e)    = return $ FunVal env n e
eval1 env (App e1 e2)  = do  val1  <- eval1 env e1
                             val2  <- eval1 env e2
                             case val1 of
                                 FunVal env' n body ->
                                     eval1 (Map.insert n val2 env') body
#+end_src

#+begin_src haskell
runEval1 (eval1 Map.empty exampleExp)
=> IntVal 18

runEval1 (eval1 Map.empty (Var "x"))
=> *** Exception: Maybe.fromJust: Nothing
#+end_src

# --------------------------------------------------
** add unbound variable error handling

#+begin_src haskell
type Eval2 alpha = ErrorT String Identity alpha

runEval2     :: Eval2 alpha -> Either String alpha
runEval2 ev  = runIdentity (runErrorT ev)

eval2a                 :: Env -> Exp -> Eval2 Value
eval2a env (Var n)      = case (Map.lookup n env) of
                              Nothing -> fail $ "unbound var: " ++ n
                              Just v  -> return v
#+end_src

#+begin_src haskell
runEval2 (eval2a Map.empty exampleExp)
=> Right (IntVal 18)

runEval2 (eval2a Map.empty (Var "no-way"))
=> Left "unbound var: no-way"

-- type error, but not apparent in error message
runEval2 (eval2a Map.empty (Plus (Lit 12) (Abs "x" (Var "x"))))
=> Left "Pattern match failure in do expression at transformers.hs:138:34-42"
#+end_src

# --------------------------------------------------
