haskell/paper/haroldcarr/2014-02-11-monads-at-lambda-lounge-slc/20-motivation.html

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">equivalent monadic evaluator</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #A52A2A; font-weight: bold;">type</span> <span style="color: #2F8B58; font-weight: bold;">Eval1</span> alpha  <span style="color: #0084C8; font-weight: bold;">=</span>   <span style="color: #2F8B58; font-weight: bold;">Identity</span> alpha

<span style="color: #00578E; font-weight: bold;">runEval1</span>          <span style="color: #0084C8; font-weight: bold;">::</span>  <span style="color: #2F8B58; font-weight: bold;">Eval1</span> alpha <span style="color: #0084C8; font-weight: bold;">-&gt;</span> alpha
<span style="color: #00578E; font-weight: bold;">runEval1</span> ev       <span style="color: #0084C8; font-weight: bold;">=</span>   runIdentity ev

<span style="color: #00578E; font-weight: bold;">eval1</span>                 <span style="color: #0084C8; font-weight: bold;">::</span> <span style="color: #2F8B58; font-weight: bold;">Env</span> <span style="color: #0084C8; font-weight: bold;">-&gt;</span> <span style="color: #2F8B58; font-weight: bold;">Exp</span> <span style="color: #0084C8; font-weight: bold;">-&gt;</span> <span style="color: #2F8B58; font-weight: bold;">Eval1</span> <span style="color: #2F8B58; font-weight: bold;">Value</span>
<span style="color: #00578E; font-weight: bold;">eval1</span> env (<span style="color: #2F8B58; font-weight: bold;">Lit</span> i)      <span style="color: #0084C8; font-weight: bold;">=</span> return <span style="color: #0084C8; font-weight: bold;">$</span> <span style="color: #2F8B58; font-weight: bold;">IntVal</span> i
<span style="color: #00578E; font-weight: bold;">eval1</span> env (<span style="color: #2F8B58; font-weight: bold;">Var</span> n)      <span style="color: #0084C8; font-weight: bold;">=</span> return <span style="color: #0084C8; font-weight: bold;">$</span> fromJust (<span style="color: #2F8B58; font-weight: bold;">Map</span><span style="color: #0084C8; font-weight: bold;">.</span>lookup n env)
<span style="color: #00578E; font-weight: bold;">eval1</span> env (<span style="color: #2F8B58; font-weight: bold;">Plus</span> e1 e2) <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #A52A2A; font-weight: bold;">do</span>  <span style="color: #2F8B58; font-weight: bold;">IntVal</span> i1  <span style="color: #0084C8; font-weight: bold;">&lt;-</span> eval1 env e1
                             <span style="color: #2F8B58; font-weight: bold;">IntVal</span> i2  <span style="color: #0084C8; font-weight: bold;">&lt;-</span> eval1 env e2
                             return <span style="color: #0084C8; font-weight: bold;">$</span> <span style="color: #2F8B58; font-weight: bold;">IntVal</span> (i1 <span style="color: #0084C8; font-weight: bold;">+</span> i2)
<span style="color: #00578E; font-weight: bold;">eval1</span> env (<span style="color: #2F8B58; font-weight: bold;">Abs</span> n e)    <span style="color: #0084C8; font-weight: bold;">=</span> return <span style="color: #0084C8; font-weight: bold;">$</span> <span style="color: #2F8B58; font-weight: bold;">FunVal</span> env n e
<span style="color: #00578E; font-weight: bold;">eval1</span> env (<span style="color: #2F8B58; font-weight: bold;">App</span> e1 e2)  <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #A52A2A; font-weight: bold;">do</span>  val1  <span style="color: #0084C8; font-weight: bold;">&lt;-</span> eval1 env e1
                             val2  <span style="color: #0084C8; font-weight: bold;">&lt;-</span> eval1 env e2
                             <span style="color: #A52A2A; font-weight: bold;">case</span> val1 <span style="color: #A52A2A; font-weight: bold;">of</span>
                                 <span style="color: #2F8B58; font-weight: bold;">FunVal</span> env' n body <span style="color: #0084C8; font-weight: bold;">-&gt;</span>
                                     eval1 (<span style="color: #2F8B58; font-weight: bold;">Map</span><span style="color: #0084C8; font-weight: bold;">.</span>insert n val2 env') body
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #00578E; font-weight: bold;">runEval1</span> (eval1 <span style="color: #2F8B58; font-weight: bold;">Map</span><span style="color: #0084C8; font-weight: bold;">.</span>empty exampleExp)
<span style="color: #0084C8; font-weight: bold;">=&gt;</span> <span style="color: #2F8B58; font-weight: bold;">IntVal</span> 18

<span style="color: #00578E; font-weight: bold;">runEval1</span> (eval1 <span style="color: #2F8B58; font-weight: bold;">Map</span><span style="color: #0084C8; font-weight: bold;">.</span>empty (<span style="color: #2F8B58; font-weight: bold;">Var</span> <span style="color: #4E9A06;">"x"</span>))
<span style="color: #0084C8; font-weight: bold;">=&gt;</span> <span style="color: #0084C8; font-weight: bold;">***</span> <span style="color: #2F8B58; font-weight: bold;">Exception:</span> <span style="color: #2F8B58; font-weight: bold;">Maybe</span><span style="color: #0084C8; font-weight: bold;">.</span>fromJust<span style="color: #2F8B58; font-weight: bold;">:</span> <span style="color: #2F8B58; font-weight: bold;">Nothing</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">add unbound variable error handling</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #A52A2A; font-weight: bold;">type</span> <span style="color: #2F8B58; font-weight: bold;">Eval2</span> alpha <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #2F8B58; font-weight: bold;">ErrorT</span> <span style="color: #2F8B58; font-weight: bold;">String</span> <span style="color: #2F8B58; font-weight: bold;">Identity</span> alpha

<span style="color: #00578E; font-weight: bold;">runEval2</span>     <span style="color: #0084C8; font-weight: bold;">::</span> <span style="color: #2F8B58; font-weight: bold;">Eval2</span> alpha <span style="color: #0084C8; font-weight: bold;">-&gt;</span> <span style="color: #2F8B58; font-weight: bold;">Either</span> <span style="color: #2F8B58; font-weight: bold;">String</span> alpha
<span style="color: #00578E; font-weight: bold;">runEval2</span> ev  <span style="color: #0084C8; font-weight: bold;">=</span> runIdentity (runErrorT ev)

<span style="color: #00578E; font-weight: bold;">eval2a</span>                 <span style="color: #0084C8; font-weight: bold;">::</span> <span style="color: #2F8B58; font-weight: bold;">Env</span> <span style="color: #0084C8; font-weight: bold;">-&gt;</span> <span style="color: #2F8B58; font-weight: bold;">Exp</span> <span style="color: #0084C8; font-weight: bold;">-&gt;</span> <span style="color: #2F8B58; font-weight: bold;">Eval2</span> <span style="color: #2F8B58; font-weight: bold;">Value</span>
<span style="color: #00578E; font-weight: bold;">eval2a</span> env (<span style="color: #2F8B58; font-weight: bold;">Var</span> n)      <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #A52A2A; font-weight: bold;">case</span> (<span style="color: #2F8B58; font-weight: bold;">Map</span><span style="color: #0084C8; font-weight: bold;">.</span>lookup n env) <span style="color: #A52A2A; font-weight: bold;">of</span>
                              <span style="color: #2F8B58; font-weight: bold;">Nothing</span> <span style="color: #0084C8; font-weight: bold;">-&gt;</span> fail <span style="color: #0084C8; font-weight: bold;">$</span> <span style="color: #4E9A06;">"unbound var: "</span> <span style="color: #0084C8; font-weight: bold;">++</span> n
                              <span style="color: #2F8B58; font-weight: bold;">Just</span> v  <span style="color: #0084C8; font-weight: bold;">-&gt;</span> return v
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #00578E; font-weight: bold;">runEval2</span> (eval2a <span style="color: #2F8B58; font-weight: bold;">Map</span><span style="color: #0084C8; font-weight: bold;">.</span>empty exampleExp)
<span style="color: #0084C8; font-weight: bold;">=&gt;</span> <span style="color: #2F8B58; font-weight: bold;">Right</span> (<span style="color: #2F8B58; font-weight: bold;">IntVal</span> 18)

<span style="color: #00578E; font-weight: bold;">runEval2</span> (eval2a <span style="color: #2F8B58; font-weight: bold;">Map</span><span style="color: #0084C8; font-weight: bold;">.</span>empty (<span style="color: #2F8B58; font-weight: bold;">Var</span> <span style="color: #4E9A06;">"no-way"</span>))
<span style="color: #0084C8; font-weight: bold;">=&gt;</span> <span style="color: #2F8B58; font-weight: bold;">Left</span> <span style="color: #4E9A06;">"unbound var: no-way"</span>

<span style="color: #5F7F5F;">-- </span><span style="color: #204A87;">type error, but not apparent in error message</span>
<span style="color: #00578E; font-weight: bold;">runEval2</span> (eval2a <span style="color: #2F8B58; font-weight: bold;">Map</span><span style="color: #0084C8; font-weight: bold;">.</span>empty (<span style="color: #2F8B58; font-weight: bold;">Plus</span> (<span style="color: #2F8B58; font-weight: bold;">Lit</span> 12) (<span style="color: #2F8B58; font-weight: bold;">Abs</span> <span style="color: #4E9A06;">"x"</span> (<span style="color: #2F8B58; font-weight: bold;">Var</span> <span style="color: #4E9A06;">"x"</span>))))
<span style="color: #0084C8; font-weight: bold;">=&gt;</span> <span style="color: #2F8B58; font-weight: bold;">Left</span> <span style="color: #4E9A06;">"Pattern match failure in do expression at transformers.hs:138:34-42"</span>
</pre>
</div>
</div>
</div>
