haskell/paper/haroldcarr/2014-02-11-monads-at-lambda-lounge-slc/20-motivation.org
** handle type errors

#+begin_src haskell
eval2b env (Plus e1 e2) = do  e1'  <- eval2b env e1
                              e2'  <- eval2b env e2
                              case (e1', e2') of
                                (IntVal i1, IntVal i2)
                                  -> return $ IntVal (i1 + i2)
                                _ -> throwError "type error in Plus"
eval2b env (App e1 e2)  = do  val1  <- eval2b env e1
                              val2  <- eval2b env e2
                              case val1 of
                                  FunVal env' n body
                                    -> eval2b (Map.insert n val2 env') body
                                  _ -> throwError "type error in App"
#+end_src

#+begin_src haskell
runEval2 (eval2b Map.empty (Plus (Lit 12) (Abs "x" (Var "x"))))
=> Left "type error in Plus"
#+end_src

# --------------------------------------------------
** hide the environment

=Env= only
- extended in =App=
- used in =Var= and =Abs=

#+begin_src haskell
type Eval3 alpha = ReaderT Env (ErrorT String Identity) alpha

runEval3     :: Env -> Eval3 alpha -> Either String alpha
runEval3 env ev  = runIdentity (runErrorT (runReaderT ev env))

eval3             :: Exp -> Eval3 Value
eval3 (Var n)      = do env <- ask
                        case Map.lookup n env of
                          Nothing  -> throwError ("unbound var: " ++ n)
                          Just val -> return val
eval3 (Abs n e)    = do env <- ask
                        return $ FunVal env n e
eval3 (App e1 e2)  = do val1  <- eval3 e1
                        val2  <- eval3 e2
                        case val1 of
                          FunVal env' n body
                             -> local (const (Map.insert n val2 env'))
                                      (eval3 body)
                          _  -> throwError "type error in application"
#+end_src

#+begin_src haskell
runEval3 Map.empty (eval3 exampleExp)
=> Right (IntVal 18)
#+end_src

# --------------------------------------------------
** add state (simulated mutability)

add profiling to interpreter

#+begin_src haskell
type Eval4 alpha = ReaderT Env (ErrorT String (StateT Integer Identity)) alpha

runEval4            ::  Env -> Integer -> Eval4 alpha -> (Either String alpha, Integer)
runEval4 env st ev  =   runIdentity (runStateT (runErrorT (runReaderT ev env)) st)

tick :: (Num s, MonadState s m) => m ()
tick = do  st <- get
           put (st + 1)

eval4             :: Exp -> Eval4 Value
eval4 (Lit i)      = do tick
                        return $ IntVal i
eval4 (Var n)      = do tick
                        env <- ask
                        ...
#+end_src

#+begin_src haskell
runEval4 Map.empty 0 (eval4 exampleExp)
=> (Right (IntVal 18),8) -- 8 reduction steps
#+end_src

# --------------------------------------------------
