haskell/paper/haroldcarr/2014-02-11-monads-at-lambda-lounge-slc/20-motivation.html

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">handle type errors</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #00578E; font-weight: bold;">eval2b</span> env (<span style="color: #2F8B58; font-weight: bold;">Plus</span> e1 e2) <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #A52A2A; font-weight: bold;">do</span>  e1'  <span style="color: #0084C8; font-weight: bold;">&lt;-</span> eval2b env e1
                              e2'  <span style="color: #0084C8; font-weight: bold;">&lt;-</span> eval2b env e2
                              <span style="color: #A52A2A; font-weight: bold;">case</span> (e1', e2') <span style="color: #A52A2A; font-weight: bold;">of</span>
                                (<span style="color: #2F8B58; font-weight: bold;">IntVal</span> i1, <span style="color: #2F8B58; font-weight: bold;">IntVal</span> i2)
                                  <span style="color: #0084C8; font-weight: bold;">-&gt;</span> return <span style="color: #0084C8; font-weight: bold;">$</span> <span style="color: #2F8B58; font-weight: bold;">IntVal</span> (i1 <span style="color: #0084C8; font-weight: bold;">+</span> i2)
                                <span style="color: #A52A2A; font-weight: bold;">_</span> <span style="color: #0084C8; font-weight: bold;">-&gt;</span> throwError <span style="color: #4E9A06;">"type error in Plus"</span>
<span style="color: #00578E; font-weight: bold;">eval2b</span> env (<span style="color: #2F8B58; font-weight: bold;">App</span> e1 e2)  <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #A52A2A; font-weight: bold;">do</span>  val1  <span style="color: #0084C8; font-weight: bold;">&lt;-</span> eval2b env e1
                              val2  <span style="color: #0084C8; font-weight: bold;">&lt;-</span> eval2b env e2
                              <span style="color: #A52A2A; font-weight: bold;">case</span> val1 <span style="color: #A52A2A; font-weight: bold;">of</span>
                                  <span style="color: #2F8B58; font-weight: bold;">FunVal</span> env' n body
                                    <span style="color: #0084C8; font-weight: bold;">-&gt;</span> eval2b (<span style="color: #2F8B58; font-weight: bold;">Map</span><span style="color: #0084C8; font-weight: bold;">.</span>insert n val2 env') body
                                  <span style="color: #A52A2A; font-weight: bold;">_</span> <span style="color: #0084C8; font-weight: bold;">-&gt;</span> throwError <span style="color: #4E9A06;">"type error in App"</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #00578E; font-weight: bold;">runEval2</span> (eval2b <span style="color: #2F8B58; font-weight: bold;">Map</span><span style="color: #0084C8; font-weight: bold;">.</span>empty (<span style="color: #2F8B58; font-weight: bold;">Plus</span> (<span style="color: #2F8B58; font-weight: bold;">Lit</span> 12) (<span style="color: #2F8B58; font-weight: bold;">Abs</span> <span style="color: #4E9A06;">"x"</span> (<span style="color: #2F8B58; font-weight: bold;">Var</span> <span style="color: #4E9A06;">"x"</span>))))
<span style="color: #0084C8; font-weight: bold;">=&gt;</span> <span style="color: #2F8B58; font-weight: bold;">Left</span> <span style="color: #4E9A06;">"type error in Plus"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">hide the environment</h3>
<div class="outline-text-3" id="text-1-5">
<p>
<code>Env</code> only
</p>
<ul class="org-ul">
<li>extended in <code>App</code>
</li>
<li>used in <code>Var</code> and <code>Abs</code>
</li>
</ul>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #A52A2A; font-weight: bold;">type</span> <span style="color: #2F8B58; font-weight: bold;">Eval3</span> alpha <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #2F8B58; font-weight: bold;">ReaderT</span> <span style="color: #2F8B58; font-weight: bold;">Env</span> (<span style="color: #2F8B58; font-weight: bold;">ErrorT</span> <span style="color: #2F8B58; font-weight: bold;">String</span> <span style="color: #2F8B58; font-weight: bold;">Identity</span>) alpha

<span style="color: #00578E; font-weight: bold;">runEval3</span>     <span style="color: #0084C8; font-weight: bold;">::</span> <span style="color: #2F8B58; font-weight: bold;">Env</span> <span style="color: #0084C8; font-weight: bold;">-&gt;</span> <span style="color: #2F8B58; font-weight: bold;">Eval3</span> alpha <span style="color: #0084C8; font-weight: bold;">-&gt;</span> <span style="color: #2F8B58; font-weight: bold;">Either</span> <span style="color: #2F8B58; font-weight: bold;">String</span> alpha
<span style="color: #00578E; font-weight: bold;">runEval3</span> env ev  <span style="color: #0084C8; font-weight: bold;">=</span> runIdentity (runErrorT (runReaderT ev env))

<span style="color: #00578E; font-weight: bold;">eval3</span>             <span style="color: #0084C8; font-weight: bold;">::</span> <span style="color: #2F8B58; font-weight: bold;">Exp</span> <span style="color: #0084C8; font-weight: bold;">-&gt;</span> <span style="color: #2F8B58; font-weight: bold;">Eval3</span> <span style="color: #2F8B58; font-weight: bold;">Value</span>
<span style="color: #00578E; font-weight: bold;">eval3</span> (<span style="color: #2F8B58; font-weight: bold;">Var</span> n)      <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #A52A2A; font-weight: bold;">do</span> env <span style="color: #0084C8; font-weight: bold;">&lt;-</span> ask
                        <span style="color: #A52A2A; font-weight: bold;">case</span> <span style="color: #2F8B58; font-weight: bold;">Map</span><span style="color: #0084C8; font-weight: bold;">.</span>lookup n env <span style="color: #A52A2A; font-weight: bold;">of</span>
                          <span style="color: #2F8B58; font-weight: bold;">Nothing</span>  <span style="color: #0084C8; font-weight: bold;">-&gt;</span> throwError (<span style="color: #4E9A06;">"unbound var: "</span> <span style="color: #0084C8; font-weight: bold;">++</span> n)
                          <span style="color: #2F8B58; font-weight: bold;">Just</span> val <span style="color: #0084C8; font-weight: bold;">-&gt;</span> return val
<span style="color: #00578E; font-weight: bold;">eval3</span> (<span style="color: #2F8B58; font-weight: bold;">Abs</span> n e)    <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #A52A2A; font-weight: bold;">do</span> env <span style="color: #0084C8; font-weight: bold;">&lt;-</span> ask
                        return <span style="color: #0084C8; font-weight: bold;">$</span> <span style="color: #2F8B58; font-weight: bold;">FunVal</span> env n e
<span style="color: #00578E; font-weight: bold;">eval3</span> (<span style="color: #2F8B58; font-weight: bold;">App</span> e1 e2)  <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #A52A2A; font-weight: bold;">do</span> val1  <span style="color: #0084C8; font-weight: bold;">&lt;-</span> eval3 e1
                        val2  <span style="color: #0084C8; font-weight: bold;">&lt;-</span> eval3 e2
                        <span style="color: #A52A2A; font-weight: bold;">case</span> val1 <span style="color: #A52A2A; font-weight: bold;">of</span>
                          <span style="color: #2F8B58; font-weight: bold;">FunVal</span> env' n body
                             <span style="color: #0084C8; font-weight: bold;">-&gt;</span> local (const (<span style="color: #2F8B58; font-weight: bold;">Map</span><span style="color: #0084C8; font-weight: bold;">.</span>insert n val2 env'))
                                      (eval3 body)
                          <span style="color: #A52A2A; font-weight: bold;">_</span>  <span style="color: #0084C8; font-weight: bold;">-&gt;</span> throwError <span style="color: #4E9A06;">"type error in application"</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #00578E; font-weight: bold;">runEval3</span> <span style="color: #2F8B58; font-weight: bold;">Map</span><span style="color: #0084C8; font-weight: bold;">.</span>empty (eval3 exampleExp)
<span style="color: #0084C8; font-weight: bold;">=&gt;</span> <span style="color: #2F8B58; font-weight: bold;">Right</span> (<span style="color: #2F8B58; font-weight: bold;">IntVal</span> 18)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">add state (simulated mutability)</h3>
<div class="outline-text-3" id="text-1-6">
<p>
add profiling to interpreter
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #A52A2A; font-weight: bold;">type</span> <span style="color: #2F8B58; font-weight: bold;">Eval4</span> alpha <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #2F8B58; font-weight: bold;">ReaderT</span> <span style="color: #2F8B58; font-weight: bold;">Env</span> (<span style="color: #2F8B58; font-weight: bold;">ErrorT</span> <span style="color: #2F8B58; font-weight: bold;">String</span> (<span style="color: #2F8B58; font-weight: bold;">StateT</span> <span style="color: #2F8B58; font-weight: bold;">Integer</span> <span style="color: #2F8B58; font-weight: bold;">Identity</span>)) alpha

<span style="color: #00578E; font-weight: bold;">runEval4</span>            <span style="color: #0084C8; font-weight: bold;">::</span>  <span style="color: #2F8B58; font-weight: bold;">Env</span> <span style="color: #0084C8; font-weight: bold;">-&gt;</span> <span style="color: #2F8B58; font-weight: bold;">Integer</span> <span style="color: #0084C8; font-weight: bold;">-&gt;</span> <span style="color: #2F8B58; font-weight: bold;">Eval4</span> alpha <span style="color: #0084C8; font-weight: bold;">-&gt;</span> (<span style="color: #2F8B58; font-weight: bold;">Either</span> <span style="color: #2F8B58; font-weight: bold;">String</span> alpha, <span style="color: #2F8B58; font-weight: bold;">Integer</span>)
<span style="color: #00578E; font-weight: bold;">runEval4</span> env st ev  <span style="color: #0084C8; font-weight: bold;">=</span>   runIdentity (runStateT (runErrorT (runReaderT ev env)) st)

<span style="color: #00578E; font-weight: bold;">tick</span> <span style="color: #0084C8; font-weight: bold;">::</span> (<span style="color: #2F8B58; font-weight: bold;">Num</span> s, <span style="color: #2F8B58; font-weight: bold;">MonadState</span> s m) <span style="color: #0084C8; font-weight: bold;">=&gt;</span> m <span style="color: #2F8B58; font-weight: bold;">()</span>
<span style="color: #00578E; font-weight: bold;">tick</span> <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #A52A2A; font-weight: bold;">do</span>  st <span style="color: #0084C8; font-weight: bold;">&lt;-</span> get
           put (st <span style="color: #0084C8; font-weight: bold;">+</span> 1)

<span style="color: #00578E; font-weight: bold;">eval4</span>             <span style="color: #0084C8; font-weight: bold;">::</span> <span style="color: #2F8B58; font-weight: bold;">Exp</span> <span style="color: #0084C8; font-weight: bold;">-&gt;</span> <span style="color: #2F8B58; font-weight: bold;">Eval4</span> <span style="color: #2F8B58; font-weight: bold;">Value</span>
<span style="color: #00578E; font-weight: bold;">eval4</span> (<span style="color: #2F8B58; font-weight: bold;">Lit</span> i)      <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #A52A2A; font-weight: bold;">do</span> tick
                        return <span style="color: #0084C8; font-weight: bold;">$</span> <span style="color: #2F8B58; font-weight: bold;">IntVal</span> i
<span style="color: #00578E; font-weight: bold;">eval4</span> (<span style="color: #2F8B58; font-weight: bold;">Var</span> n)      <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #A52A2A; font-weight: bold;">do</span> tick
                        env <span style="color: #0084C8; font-weight: bold;">&lt;-</span> ask
                        <span style="color: #0084C8; font-weight: bold;">...</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #00578E; font-weight: bold;">runEval4</span> <span style="color: #2F8B58; font-weight: bold;">Map</span><span style="color: #0084C8; font-weight: bold;">.</span>empty 0 (eval4 exampleExp)
<span style="color: #0084C8; font-weight: bold;">=&gt;</span> (<span style="color: #2F8B58; font-weight: bold;">Right</span> (<span style="color: #2F8B58; font-weight: bold;">IntVal</span> 18),8) <span style="color: #5F7F5F;">-- </span><span style="color: #204A87;">8 reduction steps</span>
</pre>
</div>
</div>
</div>
