haskell/paper/haroldcarr/2014-02-11-monads-at-lambda-lounge-slc/20-motivation.org
** add logging

#+begin_src haskell
type Eval5 alpha = ReaderT Env  (ErrorT String (WriterT [String] (StateT Integer Identity))) alpha

runEval5            ::  Env -> Integer -> Eval5 alpha -> ((Either String alpha, [String]), Integer)
runEval5 env st ev  =   runIdentity (runStateT (runWriterT (runErrorT (runReaderT ev env))) st)

eval5             :: Exp -> Eval5 Value
eval5 (Var n)      = do tick
                        tell [n] -- write name vars encountered during eval
                        env <- ask
                        case Map.lookup n env of
                            Nothing  -> throwError ("unbound variable: " ++ n)
                            Just val -> return val
#+end_src

#+begin_src haskell
runEval5 Map.empty 0 (eval5 exampleExp)
=> ((Right (IntVal 18),["x"]),8)
#+end_src

# --------------------------------------------------
** add IO

#+begin_src haskell
type Eval6 alpha = ReaderT Env  (ErrorT String (WriterT [String] (StateT Integer IO))) alpha

runEval6           ::  Env -> Integer -> Eval6 alpha -> IO ((Either String alpha, [String]), Integer)
runEval6 env st ev  =  runStateT (runWriterT (runErrorT (runReaderT ev env))) st

eval6             :: Exp -> Eval6 Value
eval6 (Lit i)      = do tick
                        liftIO $ print i -- print each int encountered
                        return $ IntVal i
#+end_src

#+begin_src haskell
runEval6 Map.empty 0 (eval6 exampleExp)
12
4
2
=> ((Right (IntVal 18),["x"]),8)
#+end_src

# --------------------------------------------------
** final version

#+begin_src haskell
eval6 (Lit i)      = do tick             -- profiling (i.e., state)
                        liftIO $ print i -- print each int encountered
                        return $ IntVal i
eval6 (Var n)      = do tick
                        tell [n]         -- log each var encountered
                        env <- ask       -- consult env
                        case Map.lookup n env of
                          Nothing  -> throwError ("unbound var: " ++ n)
                          Just val -> return val
eval6 (Plus e1 e2) = do tick
                        e1'  <- eval6 e1
                        e2'  <- eval6 e2
                        case (e1', e2') of
                          (IntVal i1, IntVal i2)
                            -> return $ IntVal (i1 + i2)
                          _ -> throwError "type error in addition"
eval6 (Abs n e)    = do tick
                        env <- ask
                        return $ FunVal env n e
eval6 (App e1 e2)  = do tick
                        val1  <- eval6 e1
                        val2  <- eval6 e2
                        case val1 of
                          FunVal env' n body
                            -> local (const (Map.insert n val2 env'))
                                     (eval6 body)
                          _ -> throwError "type error in application"
#+end_src

# End of file.
