haskell/paper/haroldcarr/2014-02-11-monads-at-lambda-lounge-slc/20-motivation.html

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">add logging</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #A52A2A; font-weight: bold;">type</span> <span style="color: #2F8B58; font-weight: bold;">Eval5</span> alpha <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #2F8B58; font-weight: bold;">ReaderT</span> <span style="color: #2F8B58; font-weight: bold;">Env</span>  (<span style="color: #2F8B58; font-weight: bold;">ErrorT</span> <span style="color: #2F8B58; font-weight: bold;">String</span> (<span style="color: #2F8B58; font-weight: bold;">WriterT</span> [<span style="color: #2F8B58; font-weight: bold;">String</span>] (<span style="color: #2F8B58; font-weight: bold;">StateT</span> <span style="color: #2F8B58; font-weight: bold;">Integer</span> <span style="color: #2F8B58; font-weight: bold;">Identity</span>))) alpha

<span style="color: #00578E; font-weight: bold;">runEval5</span>            <span style="color: #0084C8; font-weight: bold;">::</span>  <span style="color: #2F8B58; font-weight: bold;">Env</span> <span style="color: #0084C8; font-weight: bold;">-&gt;</span> <span style="color: #2F8B58; font-weight: bold;">Integer</span> <span style="color: #0084C8; font-weight: bold;">-&gt;</span> <span style="color: #2F8B58; font-weight: bold;">Eval5</span> alpha <span style="color: #0084C8; font-weight: bold;">-&gt;</span> ((<span style="color: #2F8B58; font-weight: bold;">Either</span> <span style="color: #2F8B58; font-weight: bold;">String</span> alpha, [<span style="color: #2F8B58; font-weight: bold;">String</span>]), <span style="color: #2F8B58; font-weight: bold;">Integer</span>)
<span style="color: #00578E; font-weight: bold;">runEval5</span> env st ev  <span style="color: #0084C8; font-weight: bold;">=</span>   runIdentity (runStateT (runWriterT (runErrorT (runReaderT ev env))) st)

<span style="color: #00578E; font-weight: bold;">eval5</span>             <span style="color: #0084C8; font-weight: bold;">::</span> <span style="color: #2F8B58; font-weight: bold;">Exp</span> <span style="color: #0084C8; font-weight: bold;">-&gt;</span> <span style="color: #2F8B58; font-weight: bold;">Eval5</span> <span style="color: #2F8B58; font-weight: bold;">Value</span>
<span style="color: #00578E; font-weight: bold;">eval5</span> (<span style="color: #2F8B58; font-weight: bold;">Var</span> n)      <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #A52A2A; font-weight: bold;">do</span> tick
                        tell [n] <span style="color: #5F7F5F;">-- </span><span style="color: #204A87;">write name vars encountered during eval</span>
                        env <span style="color: #0084C8; font-weight: bold;">&lt;-</span> ask
                        <span style="color: #A52A2A; font-weight: bold;">case</span> <span style="color: #2F8B58; font-weight: bold;">Map</span><span style="color: #0084C8; font-weight: bold;">.</span>lookup n env <span style="color: #A52A2A; font-weight: bold;">of</span>
                            <span style="color: #2F8B58; font-weight: bold;">Nothing</span>  <span style="color: #0084C8; font-weight: bold;">-&gt;</span> throwError (<span style="color: #4E9A06;">"unbound variable: "</span> <span style="color: #0084C8; font-weight: bold;">++</span> n)
                            <span style="color: #2F8B58; font-weight: bold;">Just</span> val <span style="color: #0084C8; font-weight: bold;">-&gt;</span> return val
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #00578E; font-weight: bold;">runEval5</span> <span style="color: #2F8B58; font-weight: bold;">Map</span><span style="color: #0084C8; font-weight: bold;">.</span>empty 0 (eval5 exampleExp)
<span style="color: #0084C8; font-weight: bold;">=&gt;</span> ((<span style="color: #2F8B58; font-weight: bold;">Right</span> (<span style="color: #2F8B58; font-weight: bold;">IntVal</span> 18),[<span style="color: #4E9A06;">"x"</span>]),8)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8">add IO</h3>
<div class="outline-text-3" id="text-1-8">
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #00578E; font-weight: bold;">runEval6</span>           <span style="color: #0084C8; font-weight: bold;">::</span>  <span style="color: #2F8B58; font-weight: bold;">Env</span> <span style="color: #0084C8; font-weight: bold;">-&gt;</span> <span style="color: #2F8B58; font-weight: bold;">Integer</span> <span style="color: #0084C8; font-weight: bold;">-&gt;</span> <span style="color: #2F8B58; font-weight: bold;">Eval6</span> alpha <span style="color: #0084C8; font-weight: bold;">-&gt;</span> <span style="color: #2F8B58; font-weight: bold;">IO</span> ((<span style="color: #2F8B58; font-weight: bold;">Either</span> <span style="color: #2F8B58; font-weight: bold;">String</span> alpha, [<span style="color: #2F8B58; font-weight: bold;">String</span>]), <span style="color: #2F8B58; font-weight: bold;">Integer</span>)
<span style="color: #00578E; font-weight: bold;">runEval6</span> env st ev  <span style="color: #0084C8; font-weight: bold;">=</span>  runStateT (runWriterT (runErrorT (runReaderT ev env))) st

<span style="color: #00578E; font-weight: bold;">eval6</span>             <span style="color: #0084C8; font-weight: bold;">::</span> <span style="color: #2F8B58; font-weight: bold;">Exp</span> <span style="color: #0084C8; font-weight: bold;">-&gt;</span> <span style="color: #2F8B58; font-weight: bold;">Eval6</span> <span style="color: #2F8B58; font-weight: bold;">Value</span>
<span style="color: #00578E; font-weight: bold;">eval6</span> (<span style="color: #2F8B58; font-weight: bold;">Lit</span> i)      <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #A52A2A; font-weight: bold;">do</span> tick
                        liftIO <span style="color: #0084C8; font-weight: bold;">$</span> print i <span style="color: #5F7F5F;">-- </span><span style="color: #204A87;">print each int encountered</span>
                        return <span style="color: #0084C8; font-weight: bold;">$</span> <span style="color: #2F8B58; font-weight: bold;">IntVal</span> i
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #00578E; font-weight: bold;">runEval6</span> <span style="color: #2F8B58; font-weight: bold;">Map</span><span style="color: #0084C8; font-weight: bold;">.</span>empty 0 (eval6 exampleExp)
12
4
2
<span style="color: #0084C8; font-weight: bold;">=&gt;</span> ((<span style="color: #2F8B58; font-weight: bold;">Right</span> (<span style="color: #2F8B58; font-weight: bold;">IntVal</span> 18),[<span style="color: #4E9A06;">"x"</span>]),8)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9">final version</h3>
<div class="outline-text-3" id="text-1-9">
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #00578E; font-weight: bold;">eval6</span> (<span style="color: #2F8B58; font-weight: bold;">Lit</span> i)      <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #A52A2A; font-weight: bold;">do</span> tick             <span style="color: #5F7F5F;">-- </span><span style="color: #204A87;">profiling (i.e., state)</span>
                        liftIO <span style="color: #0084C8; font-weight: bold;">$</span> print i <span style="color: #5F7F5F;">-- </span><span style="color: #204A87;">print each int encountered</span>
                        return <span style="color: #0084C8; font-weight: bold;">$</span> <span style="color: #2F8B58; font-weight: bold;">IntVal</span> i
<span style="color: #00578E; font-weight: bold;">eval6</span> (<span style="color: #2F8B58; font-weight: bold;">Var</span> n)      <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #A52A2A; font-weight: bold;">do</span> tick
                        tell [n]         <span style="color: #5F7F5F;">-- </span><span style="color: #204A87;">log each var encountered</span>
                        env <span style="color: #0084C8; font-weight: bold;">&lt;-</span> ask       <span style="color: #5F7F5F;">-- </span><span style="color: #204A87;">consult env</span>
                        <span style="color: #A52A2A; font-weight: bold;">case</span> <span style="color: #2F8B58; font-weight: bold;">Map</span><span style="color: #0084C8; font-weight: bold;">.</span>lookup n env <span style="color: #A52A2A; font-weight: bold;">of</span>
                          <span style="color: #2F8B58; font-weight: bold;">Nothing</span>  <span style="color: #0084C8; font-weight: bold;">-&gt;</span> throwError (<span style="color: #4E9A06;">"unbound var: "</span> <span style="color: #0084C8; font-weight: bold;">++</span> n)
                          <span style="color: #2F8B58; font-weight: bold;">Just</span> val <span style="color: #0084C8; font-weight: bold;">-&gt;</span> return val
<span style="color: #00578E; font-weight: bold;">eval6</span> (<span style="color: #2F8B58; font-weight: bold;">Plus</span> e1 e2) <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #A52A2A; font-weight: bold;">do</span> tick
                        e1'  <span style="color: #0084C8; font-weight: bold;">&lt;-</span> eval6 e1
                        e2'  <span style="color: #0084C8; font-weight: bold;">&lt;-</span> eval6 e2
                        <span style="color: #A52A2A; font-weight: bold;">case</span> (e1', e2') <span style="color: #A52A2A; font-weight: bold;">of</span>
                          (<span style="color: #2F8B58; font-weight: bold;">IntVal</span> i1, <span style="color: #2F8B58; font-weight: bold;">IntVal</span> i2)
                            <span style="color: #0084C8; font-weight: bold;">-&gt;</span> return <span style="color: #0084C8; font-weight: bold;">$</span> <span style="color: #2F8B58; font-weight: bold;">IntVal</span> (i1 <span style="color: #0084C8; font-weight: bold;">+</span> i2)
                          <span style="color: #A52A2A; font-weight: bold;">_</span> <span style="color: #0084C8; font-weight: bold;">-&gt;</span> throwError <span style="color: #4E9A06;">"type error in addition"</span>
<span style="color: #00578E; font-weight: bold;">eval6</span> (<span style="color: #2F8B58; font-weight: bold;">Abs</span> n e)    <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #A52A2A; font-weight: bold;">do</span> tick
                        env <span style="color: #0084C8; font-weight: bold;">&lt;-</span> ask
                        return <span style="color: #0084C8; font-weight: bold;">$</span> <span style="color: #2F8B58; font-weight: bold;">FunVal</span> env n e
<span style="color: #00578E; font-weight: bold;">eval6</span> (<span style="color: #2F8B58; font-weight: bold;">App</span> e1 e2)  <span style="color: #0084C8; font-weight: bold;">=</span> <span style="color: #A52A2A; font-weight: bold;">do</span> tick
                        val1  <span style="color: #0084C8; font-weight: bold;">&lt;-</span> eval6 e1
                        val2  <span style="color: #0084C8; font-weight: bold;">&lt;-</span> eval6 e2
                        <span style="color: #A52A2A; font-weight: bold;">case</span> val1 <span style="color: #A52A2A; font-weight: bold;">of</span>
                          <span style="color: #2F8B58; font-weight: bold;">FunVal</span> env' n body
                            <span style="color: #0084C8; font-weight: bold;">-&gt;</span> local (const (<span style="color: #2F8B58; font-weight: bold;">Map</span><span style="color: #0084C8; font-weight: bold;">.</span>insert n val2 env'))
                                     (eval6 body)
                          <span style="color: #A52A2A; font-weight: bold;">_</span> <span style="color: #0084C8; font-weight: bold;">-&gt;</span> throwError <span style="color: #4E9A06;">"type error in application"</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="xhtml-validation"></p>
</div>
</body>
</html>
